# SurfaceNdfType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedTransparent..::..SurfaceNdfType Property
AdvancedTransparent Class See Also
---
The property labeled "NDF" from the "AdvancedTransparent" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string SurfaceNdfType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SurfaceNdfType As String
	Get
```

Visual C++
---
```text
public:
static property String^ SurfaceNdfType {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".
# See Also
AdvancedTransparent Class
Autodesk.Revit.DB.Visual Namespace